---
kind: method
id: M:Autodesk.Revit.DB.Mesh.ComputeSurfaceArea
source: html/a77d289c-af46-b443-8bb6-c2d66c4f1207.htm
---
# Autodesk.Revit.DB.Mesh.ComputeSurfaceArea Method

Computes and returns the surface area of the mesh. The surface area is the sum of the areas of the
 constituent facets of the mesh.

## Syntax (C#)
```csharp
public double ComputeSurfaceArea()
```

## Returns
A double, representing the surface area.